[
  {
    "title": "The Problem with Ads",
    "date": "2025-11-18T12:00:00Z",
    "tags": ["ads", "privacy", "rant"],
    "content": {
      "en": [
        "Ads are everywhere on the web. Pop-ups, banners, videos that autoplay. It's annoying.",
        "They track you. Cookies, pixels, scripts watching every click. Privacy? Forgotten.",
        "Ads slow down sites. Heavy scripts make pages load slow. Bad for users.",
        "Many ads are scams or malware. Click one wrong, your computer suffers.",
        "Ads manipulate behavior. Algorithms show what keeps you clicking, not what's good.",
        "Revenue models rely on ads, but they prioritize quantity over quality.",
        "Use ad blockers. Support sites with donations. Cleaner web for all."
      ]
    }
  },
  {
    "title": "Hosting Your Own Site",
    "date": "2025-11-17T15:00:00Z",
    "tags": ["hosting", "webdev", "tools"],
    "content": {
      "en": [
        "Hosting your own site gives control. No platform rules or fees.",
        "I use GitHub for code, Vercel for deployment. Free for small projects.",
        "Supabase for databases if needed. Cheap and easy.",
        "Namecheap for domains. Super cheap, only domain price.",
        "GitHub stores code, handles versions. Connect to Vercel for auto-deploy.",
        "Vercel builds and hosts static/dynamic sites. Fast global CDN.",
        "Supabase offers Postgres, auth. Good for apps needing data.",
        "Works great for blogs, portfolios. Launch fast, scale later."
      ]
    }
  },
  {
    "title": "My Favorite Obsolete Tech",
    "date": "2025-11-16T10:30:00Z",
    "tags": ["tech", "nostalgia", "obsolete"],
    "content": {
      "en": [
        "Obsolete tech has charm. Floppy disks - tiny storage, satisfying clicks.",
        "Pagers - beeps for messages. No smartphones needed.",
        "VHS tapes - fuzzy video, rewind sounds. Better than streaming.",
        "CRT monitors - heavy, warm glow. Real feel.",
        "Old tech reminds us simplicity was better. Miss the nostalgia.",
        "Walkmans for music on the go. No subscriptions.",
        "Typewriters - mechanical typing, no distractions.",
        "These gadgets taught patience. No instant gratification."
      ]
    }
  }
]
